app/controllers/api/products_controller.rb

  def index
    @products = Product.get(params[:page], params[:order], params[:direction])
---
SELECT  "products".* FROM "products"  ORDER BY "products"."id" ASC LIMIT 5
SELECT COUNT(*) FROM "products"